run/verification/testSeveralPorousZones/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue porosity 1
);

regions
(
    boxToCell
    {
        box (.8 0.1 -1e10) (1 0.3 1e10);

        fieldValues
        (
            volScalarFieldValue porosity 0.25
            volScalarFieldValue Ts 800
        );
    }
    boxToCell
    {
        box (1.8 0.3 -1e10) (2 0.4 1e10);

        fieldValues
        (
            volScalarFieldValue porosity 0.5
            volScalarFieldValue Ts 800
        );
    }
    boxToCell
    {
        box (2.8 0.2 -1e10) (3.1 0.3 1e10);

        fieldValues
        (
            volScalarFieldValue porosity 0.75
            volScalarFieldValue Ts 800
        );
    }
    boxToCell
    {
        box (3.1 0.2 -1e10) (4.8 0.3 1e10);

        fieldValues
        (
            volScalarFieldValue porosity 0.75
            volScalarFieldValue Ts 500
        );
    }
/*
    boxToCell
    {
        box (0.2 .2 -1) (0.3 .3 1);

        fieldValues
        (
            volScalarFieldValue Ts 300
            volScalarFieldValue Tf 300
        );
    }
*/
);


// ************************************************************************* //
